In [1]:
x = 10

In [2]:
print(x)

10

In [5]:
import pandas as pd

In [7]:
data1 = pd.read_excel('D:\datasets\data1.xlsx')

In [8]:
data1

     Name  emp id   Wages
0    Abhi     1245  25000
1    soma     5541  21000
2   akash     5461  25000
3  aksith     2204  15000
4  pallav     4521  30000

In [34]:
import os

In [35]:
os.getcwd()

'C:\\Users\\HP'

In [36]:
data2 = pd.read_csv('data2.csv')

In [37]:
data2

    Name   class  Roll number
0    Abhi      5         1103
1    Soma     10         1104
2   Akash     11         1105
3  saurav     10         1106
4  sakshi      9         1107

In [38]:
data1 = pd.read_excel('data1.xlsx')

In [39]:
data1

     Name  emp id   Wages
0    Abhi     1245  25000
1    soma     5541  21000
2   akash     5461  25000
3  aksith     2204  15000
4  pallav     4521  30000

In [40]:
data3 = pd.read_csv('data3.tsv',sep= '\t')

In [41]:
data3

    Name  class subjects
0   Abhi      5  science
1  Rekha      6    Maths
2  Kullu      7    Hindi
3    Adi      8    Maths
4  Sonam      9      Eng